benchmark_results_replicated/20260423_101844/analysis/rep28/run/go_heavy_c50/wrk_output.txt
Running 1m test @ http://localhost:8080/days-since-heavy
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    92.29ms   75.39ms 695.84ms   55.31%
    Req/Sec   144.53     49.33   360.00     69.29%
  Latency Distribution
     50%   96.39ms
     75%  107.14ms
     90%  197.56ms
     99%  310.04ms
  34573 requests in 1.00m, 4.65MB read
Requests/sec:    575.36
Transfer/sec:     79.22KB
P95: 213656
P99: 310038